import networkx as nx

G = nx.Graph()
G.add_nodes_from(["Закарпаття", "Львівська", "Волиньська", "Рівненська", "Тернопільська", "Івано-Франківська",
                  "Чернівецька", "Хмельницька", "Вінницька", "Житомірська", "Київська", "Чернігівська",
                  "Черкаська", "Кіровоградська", "Одеська", "Миколаївська", "Херсонська", "Кримська", "Дніпропетровська",
                  "Полтавська", "Сумська", "Харківська", "Луганська", "Донецька", "Запоріжська"])
G.add_weighted_edges_from([("Закарпаття", "Львівська", 261), ("Закарпаття", "Івано-Франківська", 280)])
G.add_weighted_edges_from([("Львівська", "Волиньська", 152), ("Львівська", "Івано-Франківська", 135),
                           ("Львівська", "Тернопільська", 128), ("Львівська", "Рівненська", 232)])
G.add_edge("Волиньська", "Рівненська", weight=70)
G.add_weighted_edges_from([("Івано-Франківська", "Чернівецька", 143), ("Івано-Франківська", "Тернопільська", 134)])
G.add_weighted_edges_from([("Тернопільська", "Чернівецька", 176), ("Тернопільська", "Хмельницька", 112),
                           ("Тернопільська", "Рівненська", 162)])
G.add_weighted_edges_from([("Рівненська", "Хмельницька", 193), ("Рівненська", "Житомірська", 187)])
G.add_weighted_edges_from([("Хмельницька", "Чернівецька", 190), ("Хмельницька", "Житомірська",185), ("Хмельницька", "Вінницька", 120)])
G.add_weighted_edges_from([("Вінницька", "Чернівецька", 312), ("Вінницька", "Житомірська", 125), ("Вінницька", "Київська", 256),
                  ("Вінницька", "Черкаська", 343), ("Вінницька", "Кіровоградська", 316), ("Вінницька", "Одеська", 428)])
G.add_weighted_edges_from([("Київська", "Житомірська", 131), ("Київська", "Чернігівська", 149), ("Київська", "Полтавська", 337),
                  ("Київська", "Черкаська", 190)])
G.add_weighted_edges_from([("Черкаська", "Кіровоградська", 126), ("Черкаська", "Полтавська", 279)])
G.add_weighted_edges_from([("Полтавська", "Чернігівська", 477), ("Полтавська", "Сумська", 261), ("Полтавська", "Харківська", 141),
                  ("Полтавська", "Дніпропетровська", 196), ("Полтавська", "Кіровоградська", 246)])
G.add_edge("Чернігівська", "Сумська", weight = 350)
G.add_weighted_edges_from([("Харківська", "Луганська", 333), ("Харківська", "Сумська", 190), ("Харківська", "Донецька", 335),
                  ("Харківська", "Дніпропетровська", 213)])
G.add_weighted_edges_from([("Донецька", "Луганська", 148), ("Донецька", "Дніпропетровська", 252), ("Донецька", "Запоріжська", 217)])
G.add_weighted_edges_from([("Кіровоградська", "Одеська", 294), ("Кіровоградська", "Дніпропетровська", 294), ("Кіровоградська", "Миколаївська", 174)])
G.add_weighted_edges_from([("Миколаївська", "Одеська", 120), ("Миколаївська", "Дніпропетровська", 343), ("Миколаївська", "Херсонська", 51)])
G.add_weighted_edges_from([("Херсонська", "Запоріжська", 297), ("Херсонська", "Дніпропетровська", 376), ("Херсонська", "Кримська", 221)])
G.add_edge("Дніпропетровська", "Запоріжська", weight = 81)


